{
  "GlobalFarmer": {
    "Parts": [
      {
        "Picture": "media/stories/GlobalFarmer/global-farmer-logo.webp",
        "Paragraph": "From April to December 2024, I worked at Thera Bytes on Global Farmer, my first commercial game release. I contributed to the project both before and after its Early Access launch, gaining valuable experience in studio workflows and maintaining a professional codebase."
      },
      {
        "Picture": "media/stories/GlobalFarmer/gf-animals-farm.webp",
        "Paragraph": "I designed and implemented the animal system for Global Farmer, managing complex mechanics like consumption, production, costs, and independent migration. Building this extensible system required balancing accessibility for UI and other project components with security against unintended behavior. As a core feature of the game, I approached its functionality from both the player's perspective and the needs of my colleagues, ensuring seamless interaction and reliable data flow."
      },
      {
        "Picture": "media/stories/GlobalFarmer/gf-animals-pasture.webp",
        "Paragraph": "I developed the migration algorithm for animals in Global Farmer, enabling them to move between pastures and fields daily based on conditions like weather. I also designed systems for automating employee and machine usage during planting. These challenges required a focus on optimization, readability, and scalability, ensuring the algorithms could adapt to future needs."
      },
      {
        "Picture": "media/stories/GlobalFarmer/gf-planting.webp",
        "Paragraph": "Collaborating with the lead game designer, I re-designed and re-implemented the planting system and UI. Given its central role in the core gameplay loop, we focused on perfecting every detail to ensure a seamless and engaging player experience."
      },
      {
        "Picture": "media/stories/GlobalFarmer/gf-timeline.webp",
        "Paragraph": "I was responsible for ensuring the UI components—like the timeline, weather graphs, and planting information—always reflected the game's current state. This was a complex task, as each UI element could potentially alter the game state in this UI-heavy game. It was a rewarding challenge to manage this aspect of the project."
      },
      {
        "Picture": "media/stories/GlobalFarmer/gf-action.webp",
        "Paragraph": "Global Farme* was my first in-depth experience with professional game development beyond freelancing. It was fulfilling to collaborate with a team of veterans and contribute to the studio's success. The project reaffirmed that the 13-year-old me made the right choice in pursuing this career."
      }
    ]
  },
  "ElementFighterZ": {
    "Parts": [
      {
        "Picture": "media/stories/Element-FighterZ/efz-logo.webp",
        "Paragraph": "Element-FighterZ was my first university project, where I led the programming effort. I decided to build a data-oriented engine with an ECS, optimized for the browser using pure JavaScript, all within a 4-week timeframe. With a small team of one other programmer and two artists, we successfully brought the project to life."
      },
      {
        "Picture": "media/stories/Element-FighterZ/efz-normal.webp",
        "Paragraph": "Not only was I proud of the engine I built—my first serious one—but we also developed a fully playable 1v1 fighting game with 4 unique characters, each with distinct abilities, and 4 different maps. We earned a perfect score for the project, and my professors were impressed with the final codebase. The game implementation took about a week and a half and was a blast, thanks to my data-oriented approach. This project confirmed that data-driven design is key for scalability and efficiency."
      },
      {
        "Picture": "media/stories/Element-FighterZ/efz-col-none.webp",
        "Paragraph": "For the platforming, I used a standard discrete collision algorithm, but for combat, I implemented a unique shader-based collision system. This approach, which I hadn't seen in other games, involved a simple white shader and XOR operations on a simplified scene, creating a fast and efficient combat collision system where what you see is truly what you get."
      },
      {
        "Picture": "media/stories/Element-FighterZ/efz-col-combat.webp",
        "Paragraph": "I was pleasantly surprised by the simplicity and speed of this approach. If I work on any combat games in the future, I’m eager to expand and optimize this technique further."
      },
      {
        "Picture": "media/stories/Element-FighterZ/efz-engine-structure.webp",
        "Paragraph": "Looking back, there are several things I would have implemented differently in the game engine, particularly within the ECS. Working on larger-scale games has taught me that simplicity is key—it helps everyone quickly get started and prevents unnecessary bloat in the codebase."
      }
    ]
  },
  "OSMLoader": {
    "Parts": [
      {
        "Picture": "media/stories/OSMLoader/osm-interface.webp",
        "Paragraph": "Great games come from empowering designers with the right tools. Creating tools tailored to specific games is a passion of mine. One of my favorites is OSMLoader, a tool I developed to parse and load OpenStreetMap data, enabling the creation of cityscapes."
      },
      {
        "Picture": "media/stories/OSMLoader/osm-result.webp",
        "Paragraph": "I enjoyed delving into the OSM XML data format and understanding its intricacies. The final result was promising for future games and gave me valuable insights into how data is structured and processed efficiently at an industrial scale."
      }
    ]
  },
  "TraderAI": {
    "Parts": [
      {
        "Picture": "media/stories/TraderAI/tai-one.webp",
        "Paragraph": "Outside of game development, I found that quantum trading perfectly aligns with my passion for research, algorithms, and data. My most successful trading AI leverages LLM technology and real-time headline data to assess market sentiment and identify future opportunities, trading accordingly."
      },
      {
        "Picture": "media/stories/TraderAI/tai-sentiment-graph.webp",
        "Paragraph": "This approach has resulted in a diversified, dynamic portfolio that performs well across various market environments. It’s taught me that listening—whether to data, patterns, or signals—is one of the most powerful skills we can develop."
      }
    ]
  }
}